Repository: magi1125/inclusive-design-pattern
Catalog: tm/chapter-11_EN-US_JA.tmx
Source language: en_us
Languages: ja

source: Thanks to standard browser behavior, any <a> element with an href attribute which is the next focusable element within the document will gain focus when the user hits the Tab key.
ja: 標準のブラウザ動作のおかげで、ユーザーがTabキーを押すと、ドキュメント内で次にフォーカス可能な要素である、href属性を持つ<a>要素にフォーカスが移動します。

source: It then becomes operable: you can follow the link by pressing Enter.
ja: これでそのリンクが操作可能になり、Enterを押せばリンクをたどることができます。

source: Even so, if links are not styled so their focus state is indicated, it’s impossible for the user to see which element is indeed in current focus.
ja: とは言え、リンクにフォーカス状態を示すスタイルが適用されていなければ、ユーザーには現在どの要素がフォーカスされているのか分かりません。

source: This is where focus styles come in.
ja: そこで登場するのがフォーカスのスタイルです。

source: Browsers implement their own focus styles ranging from dotted outlines to fuzzy blue halos.
ja: ブラウザには、ドットのアウトラインや？？ぼんやりとした青い光の輪？？など、それぞれ独自のフォーカススタイルがあります。【コメント：不安訳です。どのブラウザの表示か分かりません。原文「fuzzy blue halos」】

source: You can replace these default styles, but you should never just remove them.
ja: これらのデフォルトのスタイルは置き換えることができますが、単に削除するのは絶対に避けてください。

source: We can strengthen and simultaneously normalize the appearance of focus styles for our paragraph links across browsers by using a background-color solution.
ja: background-colorを使用することで、パラグラフのリンクのフォーカススタイルを強調すると同時に、複数のブラウザ間で標準化することができます。

source: p a:focus { outline: none; background-color: #cef; }
ja: p a:focus { outline: none; background-color: #cef; text-shadow: 0.05em 0 0 #cef, -0.05em 0 0 #cef, 0 0.05em 0 #cef, 0 -0.05em 0 #cef, 0.1em 0 0 #cef, -0.1em 0 0 #cef, 0 0.1em 0 #cef, 0 -0.1em 0 #cef; }

source: The basic dotted outline focus style compared with a blue background focus style. A background color creates a filled box which is easier to identify as focus moves between elements than the dotted outline some browsers provide by default.
ja: 背景色によって塗りつぶされたボックスが作られます。一部のブラウザがデフォルトで提供するドットのアウトラインに比べると、要素間でのフォーカスの移動が分かりやすくなります。

source: This is much clearer than the thin dotted outline that many browsers apply by default.
ja: この方が多くのブラウザでデフォルトで使用される薄いドットのアウトラインよりも明確です。

source: It’s a style implemented on the official UK government website, GOV.UK18; an exemplar of inclusive service design, with a responsibility to be usable by every British citizen.
ja: これは、イギリス政府の公式Webサイト、GOV.UK（脚注31）が実装しているスタイルです。イギリスの全国民に対して利用可能にするという責任を自覚した、インクルーシブサービスデザインの模範と言えます。

source: The subject of focus styles will come up in many patterns to follow, as more and different interactive elements are added to our vocabulary.
ja: ？？フォーカススタイルというテーマは、私たちの語彙に存在するインタラクティブ要素の数や種類が増えるにつれ、多くのパターンで現れます。？？【コメント：不安訳です。原文「The subject of focus styles will come up in many patterns to follow, as more and different interactive elements are added to ourvocabulary.」】

source: Automated Icons
ja: 自動化されたアイコン

source: Folks who update and maintain websites can be non-technical and frequently have no confidence (nor interest) in visual design.
ja: Webサイトの更新や保守を行う人は、技術に詳しくない場合があり、しばしばビジュアルデザインに自信（や興味）がありません。

source: An inclusive editorial system should be streamlined so that it doesn’t force editors to think about and deal in code or formatting.
ja: 編集者にコードやフォーマットについて考えさせたり、作業させたりすることがないよう、インクルーシブな編集システムを整える必要があります。

source: It should enable them to get on with what they’re good at without the fear of breaking anything.
ja: そうすれば、編集者は何かを壊すのではないかと恐れることなく、自分の得意とする作業を進めることができます。

source: By employing a modicum of fairly advanced CSS, it’s possible to provide iconography within paragraph text which is inclusive on two counts:
ja: 高度なCSSを少し取り入れることで、次の2つの点についてインクルーシブな形で、イコノグラフィーをパラグラフテキスト内に提供することが可能になります。

source: •It does not complicate the editorial process.
ja: • 編集プロセスを複雑にしない。

source: •It provides accessible information to users.
ja: • アクセス可能な情報をユーザーに提供する。

source: When linking to an external resource on a separate domain, it’s polite to inform the user that following the link will take them out of the current context.
ja: 別のドメインにある外部リソースにリンクする場合、そのリンクを開くと現在のコンテキストから外に移動することをユーザーに伝えた方が親切です。

source: This is especially helpful to screen reader users who will have become accustomed to the current site’s features and layout.
ja: 特に、現在のサイトの機能やレイアウトに慣れているであろうスクリーンリーダーユーザーにとっては役に立ちます。

source: In other words, you avoid a “Where the hell am I?” moment.
ja: つまり、「いったい今どこにいるんだ？」という状態にならないようにしましょう。

source: Identifying External Links
ja: 外部リンクを特定する

source: The first step is to identify which links qualify as external.
ja: 最初のステップは、外部リンクとみなされるリンクを特定することです。

source: Any link href which begins with http (i.e. is not a relative link) and does not link to the current domain passes muster.
ja: httpで始まる（つまり相対リンクではない）、現在のドメインにリンクしていないhrefはすべて外部リンクです。

source: My blog’s local domain is heydonworks.com, so I’d build a selector like this:
ja: 私のブログのローカルドメインはheydonworks.comなので、セレクタを次のように構築します。

source: Translated, the selector reads, “Links with href values that start with http but do not contain the string heydonworks.com.”
ja: 説明すると、このセレクタは「httpで始まり、heydonworks.comという文字列を含まないhref値を持つリンク」と言っています。

source: Providing the Icon
ja: アイコンの提供

source: As discussed, an inclusive editorial experience is one where the editor is not asked to think and work in an unfamiliar way.
ja: 先ほど述べたように、インクルーシブな編集体験とは、編集者がよく分からないことを考えたり作業したりすることを要求されないものです。

source: In which case, we don’t want to ask editors to have to upload and link icon images or — worse still — edit the source to add a class attribute to each external link.
ja: それを実現するには、編集者にアイコンイメージをアップロードしてリンクするよう頼むのは避けたいですし、ましてやソースを編集して各外部リンクにclass属性を追加してもらうことなど頼めません。

source: Instead, we can use CSS pseudo-content to automatically add the icon based on the matched selector:
ja: 代わりに、CSS疑似コンテンツを使用して、一致したセレクタに基づいてアイコンを自動的に追加することができます。

source: Note the use of relative units and a percentage-based background-size to make sure the icon scales with the text when it is resized by the user or in a media query.
ja: ユーザーによって、またはメディアクエリでテキストのサイズが変更されたときに、これに合わせてアイコンのサイズが変更されるよう、相対的な単位およびパーセンテージに基づくbackground-sizeが使用されていることに注目してください。

source: Alternative Text
ja: 代替テキスト

source: That just leaves adding some hidden text to also inform screen reader users that the link is external.
ja: 後は、スクリーンリーダーユーザーに、リンクが外部であることを知らせる、隠しテキストを追加するだけです。

source: This is achievable using the content property and a few supplementary rules to move it out of sight without affecting layout.
ja: これには、contentプロパティと、レイアウトに影響させずに非表示にするための補足的なルールを使用します。

source: [href^="http"]:not([href*="heydonworks.com"])::after { display: inline-block; width: 1em; height: 1em; background-image: url('path/to/external-icon.svg'); background-repeat: no-repeat; background-position: center; background-size: 75% auto; /* alternative text rules */ content: '(external link)'; overflow: hidden; white-space: nowrap; text-indent: 1em; /* the width of the icon */ }
ja: [href^="http"]:not([href*="heydonworks.com"])::after { display: inline-block; width: 1em; height: 1em; background-image: url('path/to/external-icon.svg'); background-repeat: no-repeat; background-position: center; background-size: 75% auto; /* 代替テキストのルール */ content: '(external link)'; overflow: hidden; white-space: nowrap; text-indent: 1em; /* アイコンの幅 */ }

source: It’s a common misconception that pseudo-content (in this case, “(external link)”) is not announced in screen readers19.
ja: 疑似コンテンツ（ここでは「(external link)」）はスクリーンリーダーで読み上げられないというのは、よくある誤解です。（脚注32）

source: Not all screen reader and browser combinations support pseudo-content, but most do.
ja: すべてのスクリーンリーダーとブラウザの組み合わせが疑似コンテンツをサポートしているわけではありませんが、ほとんどはサポートしています。

source: Those that don’t support it provide a less informative experience, but not a broken one.
ja: ？？サポートしていない組み合わせでは、得られる情報量は少なくなりますが、まったく役に立たないわけではありません。？？【コメント：この解釈で問題ないでしょうか。原文「Those that don’t support it provide a less informative experience, but not a broken one.」】

source: Writing Paragraphs
ja: パラグラフの記述

source: It would be remiss of me to talk about inclusive paragraph design without mentioning how to actually write approachable, accessible content.
ja: 分かりやすくて利用しやすいコンテンツを実際に書く方法に触れずに、インクルーシブなパラグラフデザインについて語ることは許されないでしょう。

source: Copywriting requires design just as much as form and composition, but in a culture dominated by visual design it tends to be put to one side; deferred until frankly less important decisions about aesthetics and ornamentation have been settled.
ja: コピーライティングは、フォームや構図と同じくらいデザインを必要としますが、視覚的なデザインが優位にある文化の中で、後回しにされがちです。実のところ、これより重要性の低い、見た目の美しさや装飾が決定されるまで保留されてしまいます。

source: I’m a big believer in content-first design20.
ja: 私は、コンテンツファーストのデザインを強く信じています。（脚注33）

source: As stated in the principles outlined in the introduction, all other design activities should be treated as merely supportive of the content and its formation.
ja: 「はじめに」で概説した原則で述べたように、他のすべてのデザイン活動は、コンテンツやその編成を単に支えるものとして行うべきです。

source: What makes things hard is that, unlike dealing in accessible interaction states or color contrast levels, accessible wording is not easy to measure.
ja: 難しいのは、アクセシブルなインタラクション状態や色のコントラストレベルでの対処とは異なり、アクセシブルな言葉遣いは簡単には評価できないということです。

source: Nonetheless, there are some general guidelines that are applicable to paragraph text:
ja: とは言え、パラグラフテキストに適用できる汎用的なガイドラインがいくつかあります。

source: •Write short paragraphs, sentences and words.
ja: • パラグラフ、文章、単語は短くする。

source: “I purchased a mammalian companion of the canine variety” is never better than “I bought a dog.”
ja: 「私は共に過ごすイヌ科の哺乳類を購入した」が「私は犬を買った」に勝ることはありません。

source: •Be wary of passive sentences21.
ja: • 受動態の文に気を付ける。（脚注34）

source: They can often be replaced by a more direct alternative.
ja: 多くの場合、より直接的な表現に置き換えることができます。

source: There’s no need to say the convoluted, “a pork pie was eaten by Harry” when you can just as well say, “Harry ate a pork pie.”
ja: 回りくどく言う必要はありません。「ハリーがポークパイを食べた」と言えるのに、「ポークパイがハリーに食べられた」とする必要はありません。

source: •Eliminate redundancy.
ja: • 重複は避ける。

source: It’s rarely worth saying the same thing twice in different ways.
ja: たいていの場合、別の方法で同じことを2回言っても価値はありません。

source: Avoid repetition.
ja: 繰り返しはやめましょう

source: (See what I did there?)
ja: （？？悪い例を実演してみました？？）。【コメント：意訳しています。原文「See what I did there?」】

source: •Vary the length of sentences and paragraphs.
ja: • 文章やパラグラフの長さに、ばらつきを持たせる。

source: This reduces monotony, encouraging focus.
ja: 単調さが軽減し、読む人を飽きさせません。

source: Acknowledging the importance of good copy design will form a part of many patterns in this book.
ja: 本書で述べる多くのパターンに、優れたコピーデザインの重要性を理解することが含まれています。

source: For example, “The Blog Post” will cover testing content readability against the Flesch-Kincaid scale22.
ja: たとえば、「ブログ記事」ではFlesch-Kincaidスケール（脚注35）を指標としたコンテンツの読みやすさのテストについて説明します。

source: For now, note this down: everything but content is an enhancement.
ja: ここではまず、コンテンツ以外のすべては補強である、ということを覚えておいてください。

source: Therefore, your prototypes and minimum viable product should contain real and preferably well-considered copy, ready to be tested with your users.
ja: したがって、プロトタイプと実用最小限のプロダクトは、実際の、できれば十分に練られたコピーを含み、ユーザーがテストできる状態になっているべきです。

source: If you’re going to get something right from the outset make it the content, not the typography, layout or color scheme.
ja: 根本から正しいものを作ろうとするのであれば、タイポグラフィでもレイアウトでもカラースキームでもなく、しっかりとしたコンテンツを作ってください。

source: Summary
ja: まとめ

source: Well, there’s more that goes into humble paragraph text design than perhaps you first imagined.
ja: 地味なパラグラフテキストのデザインには、皆さんが最初にイメージしていたよりも、おそらくたくさんのことが含まれています。

source: By looking at typefaces, leading, measure, justification, contrast, focus indication and more, we’ve set ourselves on the right path to formulate paragraphs suited for a hugely diverse audience.
ja: 書体、行送り、カラム幅、行端揃え、コントラスト、フォーカス状態の表示などを学ぶことで、非常に多様な閲覧者に合ったパラグラフを計画するための、正しい第一歩を踏み出しました。

source: By tackling specific issues we know would affect folks with limited vision, dyslexia, Irlen syndrome, low literacy and limited technical knowledge, a comfortable reading and interaction experience has been ensured for most everyone else.
ja: 視力の制限、ディスレクシア、アーレン症候群を持っていたり、識字能力に問題があったり、広い技術知識を持たない人々に影響すると分かっている、特定の問題に対処することで、快適に読んだり、操作したりできる体験をほぼすべての人に提供できます。

source: Things to Avoid
ja: 避けるべきこと

source: •Wording and typefaces designed to impress rather than communicate.
ja: • 伝達することではなく、印象付けることを目的にデザインした言葉遣いや書体

source: •A measure that’s too long or too short.
ja: • 長すぎる、または短すぎるカラム幅

source: •Reasonably high contrast, without defaulting to stark black on white.
ja: • デフォルトの白地に黒ではない、かなり高いコントラスト

source: •Eliminating focus styles with outline: none;.
ja: • outline:none;を使用してフォーカススタイルを削除

source: 1.http://bradfrost.com/blog/post/atomic-web-design/#atoms 2.https://en.wikipedia.org/wiki/X-height 3.http://bdatech.org/what-technology/typefaces-for-dyslexia/ 4.http://sugoru.com/2013/07/14/designing-for-the-extremes/ 5.http://sugoru.com/2013/07/14/designing-for-the-extremes/ 6.http://dyslexiahelp.umich.edu/sites/default/files/good_fonts_for_dyslexia_study.pdf 7.http://www.fastcodesign.com/3038596/fast-feed/a-typeface-for-dyslexics-dont-buy-into-the-hype 8.https://developer.mozilla.org/en/docs/Web/CSS/hyphens 9.https://github.com/mnater/Hyphenator 10.https://www.w3.org/TR/WCAG20/#visual-audio-contrast-visual-presentation 11.http://www.dasplankton.de/ContrastA/ 12.http://colorsafe.co/ 13.https://www.paciellogroup.com/resources/contrastanalyser/ 14.http://irlen.com/what-is-irlen-syndrome/ 15.https://medium.com/designing-medium/crafting-link-underlines-on-medium-7c03a9274f9#.hnbr08cjr 16.http://www.bltt.org/hardware/joysticks.htm 17.https://en.wikipedia.org/wiki/Switch_access 18.https://www.gov.uk/ 19.http://tink.uk/accessibility-support-for-css-generated-content/ 20.http://alistapart.com/blog/post/content-first-design 21.https://en.wikipedia.org/wiki/English_passive_voice 22.https://en.wikipedia.org/wiki/Flesch%E2%80%93Kincaid_readability_tests
ja: 15 http://bradfrost.com/blog/post/atomic-web-design/#atoms 16 https://en.wikipedia.org/wiki/X-height 17 http://bdatech.org/what-technology/typefaces-for-dyslexia/ 18 http://sugoru.com/2013/07/14/designing-for-the-extremes/ 19 http://smashed.by/dyslexiastudy 20 http://smashed.by/dyslexiafont 21 https://developer.mozilla.org/en/docs/Web/CSS/hyphens 22 https://github.com/mnater/Hyphenator 23 http://smashed.by/levelaaa 24 http://www.dasplankton.de/ContrastA/ 25 http://colorsafe.co/ 26 https://www.paciellogroup.com/resources/contrastanalyser/ 27 http://irlen.com/what-is-irlen-syndrome/ 28 http://smashed.by/underlines 29 http://www.bltt.org/hardware/joysticks.htm 30 https://en.wikipedia.org/wiki/Switch_access 31 https://www.gov.uk/ 32 http://tink.uk/accessibility-support-for-css-generated-content/ 33 http://alistapart.com/blog/post/content-first-design 34 https://en.wikipedia.org/wiki/English_passive_voice 35 http://smashed.by/flesch
